citrus-it/illumos-omnios/usr/src/man/man1/profiles.1
.\" The contents of this file are subject to the terms of the Common
.\" Development and Distribution License (the "License").  You may not use
.\" this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or
.\" http://www.opensolaris.org/os/licensing.  See the License for the
.\" specific language governing permissions and limitations under the
.\" License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each file
.\" and include the License file at usr/src/OPENSOLARIS.LICENSE.  If
.\" applicable, add the following below this CDDL HEADER, with the fields
.\" enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" Copyright (c) 2000, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright 2022 OmniOS Community Edition (OmniOSce) Association.
.\"
.Dd February 28, 2022
.Dt PROFILES 1
.Os
.Sh NAME
.Nm profiles
.Nd print execution profiles for a user
.Sh SYNOPSIS
.Nm
.Op Fl l
.Op Fl c Ar command
.Oo Ar user Oc Ns \&,...
.Sh DESCRIPTION
The
.Nm
command prints on standard output the names of the execution profiles that have
been assigned to you or to the optionally-specified user or role name.
Profiles are a bundling mechanism used to enumerate the commands and
authorizations needed to perform a specific function.
Along with each listed executable are the process attributes, such as the
effective user and group IDs, with which the process runs when started by a
privileged command interpreter.
The profile shells are
.Sy pfcsh ,
.Sy pfksh ,
and
.Sy pfexec .
See the
.Xr pfexec 1
man page.
Profiles can contain other profiles defined in
.Xr prof_attr 4 .
.Pp
Multiple profiles can be combined to construct the appropriate access control.
When profiles are assigned, the authorizations are added to the existing set.
If the same command appears in multiple profiles, the first occurrence, as
determined by the ordering of the profiles, is used for process-attribute
settings.
For convenience, a wild card can be specified to match all commands.
.Pp
When profiles are interpreted, the profile list is loaded from
.Xr user_attr 4 .
If any default profile is defined in
.Pa /etc/security/policy.conf
.Pq see Xr policy.conf 4 ,
the list of default profiles are added to the list loaded from
.Xr user_attr 4 .
Matching entries in
.Xr prof_attr 4
provide the authorizations list, and matching entries in
.Xr exec_attr 4
provide the commands list.
.Sh OPTIONS
The following options are supported:
.Bl -tag -width Ds
.It Fl c Ar command
Limit the search to execution profiles which match the provided command.
.It Fl l
Lists the commands in each profile followed by the special process attributes
such as user and group IDs.
.El
.Sh FILES
.Bl -item
.It
.Pa /etc/security/exec_attr
.It
.Pa /etc/security/prof_attr
.It
.Pa /etc/user_attr
.It
.Pa /etc/security/policy.conf
.El
.Sh EXIT STATUS
The following exit values are returned:
.Bl -tag -width Ds
.It 0
Successful completion.
.It 1
An error occurred.
.El
.Sh EXAMPLES
.Sy Example 1 No Sample Output
.Pp
The output of the
.Nm
command has the following form:
.Bd -literal -offset 4n
% profiles tester01 tester02
tester01:
          Primary Administrator
          Basic Solaris User
          All

tester02:
          Software Installation
          Basic Solaris User
          All
.Ed
.Pp
.Sy Example 2 No Using Fl l No to show more detail
.Bd -literal -offset 4n
% profiles -l tester01 tester02
tester01:
      Primary Administrator
          *                          uid=0
                                     gid=0
      Basic Solaris User
          /usr/lib/fs/smbfs/mount    privs=sys_mount
          /usr/lib/fs/smbfs/umount   privs=sys_mount
      All
          *

tester02:
      Software Installation
          /usr/bin/pkg               uid=0
          /sbin/beadm                uid=0
                                     gid=bin
      Basic Solaris User
          /usr/lib/fs/smbfs/mount    privs=sys_mount
          /usr/lib/fs/smbfs/umount   privs=sys_mount
      All
          *
.Ed
.Pp
.Sy Example 3 No Requesting output for a specific command
.Bd -literal -offset 4n
% ./profiles -c /sbin/beadm -l tester02
tester02:
      Software Installation
          /sbin/beadm                uid=0
                                     gid=bin
      All
          *
.Ed
.Sh SEE ALSO
.Xr auths 1 ,
.Xr pfexec 1 ,
.Xr roles 1 ,
.Xr getprofattr 3SECDB ,
.Xr exec_attr 4 ,
.Xr policy.conf 4 ,
.Xr prof_attr 4 ,
.Xr user_attr 4 ,
.Xr attributes 5
