citrus-it/illumos-omnios/usr/src/man/man1/set.1
'\" te
.\" Copyright (c) 2007 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 1989 AT&T
.\" Portions Copyright (c) 1982-2007 AT&T Knowledge Ventures
.\" Portions Copyright 2021 OmniOS Community Edition (OmniOSce) Association.
.\"
.\" The contents of this file are subject to the terms of the Common
.\" Development and Distribution License (the "License").  You may not use this
.\" file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or
.\" http://www.opensolaris.org/os/licensing.  See the License for the specific
.\" language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and
.\" include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add
.\" the following below this CDDL HEADER, with the fields enclosed by brackets
.\" "[]" replaced with your own identifying information: Portions Copyright
.\" [yyyy] [name of copyright owner]
.\"
.Dd Feb 17, 2021
.Dt SET 1
.Os
.Sh NAME
.Nm set ,
.Nm unset ,
.Nm setenv ,
.Nm unsetenv ,
.Nm export
.Nd shell built-in functions to determine the characteristics for environmental variables of the current shell and its descendents.
.Sh SYNOPSIS
.Ss sh, ksh93
.Bl -item
.It
.Sy + Ns Nm set
.Op Sy + Ns Fl abCefGhkmnoprstuvx
.Oo Sy + Ns Fl o Ar option Oc Ns ...
.Op Sy + Ns Fl A Ar vname
.Oo Ar arg Oc Ns ...
.It
.Sy + Ns Nm unset
.Op Fl fnv
.Ar vname Ns ...
.It
.Sy ++ Ns Nm export
.Op Fl p
.Oo Ar name Ns Op = Ns Ar value Oc Ns ...
.El
.Ss csh
.Bl -item
.It
.Nm set
.Op Ar var Ns Op = Ns Ar value
.It
.Nm set
.Ar var
.Oo Ar n Oc = Ar word
.It
.Nm unset
.Ar pattern
.It
.Nm setenv
.Op Ar VAR Op word
.It
.Nm unsetenv
.Ar variable
.El
.Sh DESCRIPTION
.Ss sh, ksh93
.Nm
sets or unsets options and positional parameters.
Options that are specified with a
.Sy -
cause the options to be set.
Options that are specified with a
.Sy +
cause the option to be unset.
.Pp
.Nm
without any options or arguments displays the names and values of all
shell variables in the order of the collation sequence in the current locale.
The values are quoted so that they are suitable for input again to the shell.
.Pp
If no arguments are specified, not even the end of options argument
.Fl - ,
the positional parameters are unchanged.
Otherwise, unless the
.Fl A
option has been specified, the positional parameters are replaced by the list
of arguments.
A first argument of
.Fl -
is ignored when setting positional parameters.
.Pp
For backwards compatibility, a
.Nm
command without any options specified, whose first argument is
.Sy -
turns off the
.Fl v
and
.Fl x
options.
If any additional arguments are specified, they replace the positional
parameters.
.Pp
The options for set in
.Sy ksh93
are:
.Bl -tag -width Ar
.It Fl a
Set the export attribute for each variable whose name does not contain a
\&. that you assign a value in the current shell environment.
.It Fl A Ar name
Assign the arguments sequentially to the array named by
.Ar name
starting at subscript
.It Fl b
The shell writes a message to standard error as soon it detects that a
background job completes rather than waiting until the next prompt.
.It Fl B
Enable
.Sy {...}
group expansion.
On by default.
.It Fl C
Prevents existing regular files from being overwritten using the > redirection
operator.
The
.Sy >|
redirection overrides this
.Sy noclobber
option.
.It Fl e
A simple command that has a
.Sy non-zero
exit status causes the shell to exit unless the simple command is:
.Bl -bullet -offset indent
.It
contained in an
.Sy &&
or
.Sy ||
list
.It
the command immediately following
.Sy if ,
.Sy while ,
or
.Sy until
.It
contained in the pipeline following
.Sy !
.El
.It Fl f
Pathname expansion is disabled.
.It Fl G
Causes
.Sy **
by itself to also match all sub-directories during pathname expansion.
.It Fl h
Obsolete.
Causes each command whose name has the syntax of an alias to become a
tracked alias when it is first encountered.
.It Fl H
Enable !-style history expansion similar to csh.
.It Fl k
This is obsolete.
All arguments of the form
.Ar name Ns Sy = Ns Ar value
are removed and placed in the variable assignment list for the command.
Ordinarily, variable assignments must precede command arguments.
.It Fl m
When enabled, the shell runs background jobs in a separate process group and
displays a line upon completion.
This mode is enabled by default for interactive shells on systems that support
job control.
.It Fl n
The shell reads commands and checks for syntax errors, but does not execute the
command.
Usually specified on command invocation.
.It Fl o Op Ar option
If option is not specified, the list of options and their current settings is
written to standard output.
When invoked with a
.Sy +
the options are written in a format that can be input again to the shell to
restore the settings.
This option can be repeated to enable or disable multiple options.
The value of
.Ar option
must be one of the following:
.Bl -tag -width Ar
.It Sy allexport
Same as
.Fl a .
.It Sy bgnice
All background jobs are run at lower priorities.
.It Sy braceexpand
Same as
.Fl B .
.It Sy emacs
Enables or disables
.Sy emacs
editing mode.
.It Sy errexit
Same as
.Fl e .
.It Sy globstar
Equivalent to
.Fl G .
.It Sy gmacs
Enables or disables
.Sy gmacs .
.Sy gmacs
editing mode is the same as
.Sy emacs
editing mode, except for the handling of CTRL-T.
.It Sy histexpand
Same as
.Fl H .
.It Sy ignoreeof
The interactive shell does not exit on end-of-file.
.It Sy keyword
Same as
.Fl k .
.It Sy markdirs
All directory names resulting from file name generation have a trailing
.Sy /
appended.
.It Sy monitor
Same as
.Fl m .
.It Sy multiline
Use multiple lines when editing lines that are longer than the window width.
.It Sy noclobber
Same as
.Fl C .
.It Sy noexec
Same as
.Fl n .
.It Sy noglob
Same as
.Fl f .
.It Sy nolog
This has no effect.
It is provided for backward compatibility.
.It Sy notify
Same as
.Fl b .
.It Sy nounset
Same as
.Fl u .
.It Sy pipefail
A pipeline does not complete until all components of the pipeline have
completed, and the exit status of the pipeline is the value of the last command
to exit with
.Sy non-zero
exit status, or is
.Sy zero
if all commands return zero exit status.
.It Sy privileged
Same as
.Fl p .
.It Sy showme
Simple commands preceded by a ; are traced as if
.Fl x
were enabled but not executed.
.It Sy trackall
Same as
.Fl h .
.It Sy verbose
Same as
.Fl v .
.It Sy vi
Enables or disables
.Sy vi
editing mode.
.It Sy viraw
Does not use canonical input mode when using vi edit mode
.It Sy xtrace
Same as
.Fl x .
.El
.It Fl p
Privileged mode.
Disabling
.Fl p
sets the effective user id to the real user id, and the effective group id to
the real group id.
Enabling
.Fl p
restores the effective user and group ids to their values when the shell was
invoked.
The
.Fl p
option is on whenever the real and effective user id is not equal or the real
and effective group id is not equal.
User profiles are not processed when
.Fl p
is enabled.
.It Fl r
Restricted.
Enables restricted shell.
This option cannot be unset once enabled.
.It Fl s
Sort the positional parameters
.It Fl t
Obsolete.
The shell reads one command and then exits.
.It Fl u
If enabled, the shell displays an error message when it tries to expand a
variable that is unset.
.It Fl v
Verbose.
The shell displays its input onto standard error as it reads it.
.It Fl x
Execution trace.
The shell displays each command after all expansion and before execution
preceded by the expanded value of the
.Sy PS4
parameter.
.El
.Pp
The following exit values are returned by
.Nm
in
.Sy ksh93 :
.Bl -tag -width Ds
.It Sy 0
Successful completion.
.It Sy >0
An error occurred.
.El
.Pp
For each name specified,
.Sy unset
unsets the variable, or function if
.Fl f
is specified, from the current shell execution environment.
Read-only variables cannot be unset.
.Pp
The options for
.Sy unset
in
.Sy ksh93
are:
.Bl -tag -width Ar
.It Fl f
Where
.Ar name
refers to a function name, the shell unsets the function definition.
.It Fl n
If
.Ar name
refers to variable that is a reference, the variable
.Ar name
is unset rather than the variable it references.
Otherwise, this option is equivalent to the
.Fl v
option.
.It Fl v
Where
.Ar name
refers to a variable name, the shell unsets it and removes it from the
environment.
This is the default behavior.
.El
.Pp
The following exit values are returned by
.Sy unset
in
.Sy ksh93 :
.Bl -tag -width Ds
.It Sy 0
Successful completion.
All names were successfully unset.
.It Sy >0
An error occurred, or one or more
.Ar name
operands could not be unset
.El
.Pp
.Sy export
sets the export attribute on each of the variables specified by name which
causes them to be in the environment of subsequently executed commands.
If
.Sy = Ns Ar value
is specified, the variable
.Ar name
is set to
.Ar value .
.Pp
If no
.Ar name
is specified, the names and values of all exported variables are written to
standard output.
.Pp
.Sy export
is built-in to the shell as a declaration command so that field splitting and
pathname expansion are not performed on the arguments.
Tilde expansion occurs on value.
.Pp
The options for
.Sy export
in
.Sy ksh93
are:
.Bl -tag -width Ar
.It Fl p
Causes the output to be in the form of
.Sy export
commands that can be used as input to the shell to recreate the current
exports.
.El
.Pp
The following exit values are returned by
.Sy export
in
.Sy ksh93 :
.Bl -tag -width Ds
.It Sy 0
Successful completion.
.It Sy >0
An error occurred.
.El
.Pp
On this manual page,
.Xr ksh93 1
commands that are preceded by one or two
.Sy +
characters are treated specially in the following ways:
.Bl -enum -offset indent
.It
Variable assignment lists preceding the command remain in effect when the
command completes.
.It
I/O redirections are processed after variable assignments.
.It
Errors cause a script that contains them to abort.
.It
They are not valid function names.
.It
Words, following a command preceded by
.Sy ++
that are in the format of a variable assignment, are expanded with the same
rules as a variable assignment.
This means that tilde substitution is performed after the
.Sy =
sign and field splitting and file name generation are not performed.
.El
.Ss csh
With no arguments,
.Nm set
displays the values of all shell variables.
Multiword values are displayed as a parenthesized list.
With the
.Ar var
argument alone,
.Nm
assigns an empty (null) value to the variable
.Ar var .
With arguments of the form
.Ar var
.Sy =
.Ar value ,
.Nm
assigns
.Ar value
to
.Ar var ,
where
.Ar value
is one of:
.Bl -tag -width Ar -offset indent
.It Ar word
A single word (or quoted string).
.It Pq Ar wordlist
A space-separated list of words enclosed in parentheses.
.El
.Pp
Values are command and filename expanded before being assigned.
The form
.Nm set
.Ar var
.Oo Ar n Oc = Ar word
replaces the
.Ar n Ns No 'th
word in a multiword value with
.Ar word .
.Pp
.Sy unset
removes variables whose names match (filename substitution)
.Ar pattern .
All variables are removed by
.So Sy unset * Sc .
.Pp
With no arguments,
.Sy setenv
displays all environment variables.
With the
.Ar VAR
argument,
.Sy setenv
sets the environment variable
.Ar VAR
to an empty (null) value.
(By convention, environment variables are normally specified upper-case names).
With both
.Ar VAR
and
.Ar word
arguments specified,
.Nm setenv
sets
.Ar VAR
to
.Ar word ,
which must be either a single word or a quoted string.
The
.Ev PATH
variable can take multiple
.Ar word
arguments, separated by colons (see EXAMPLES).
The most commonly used environment variables,
.Ev USER ,
.Ev TERM ,
and
.Ev PATH,
are automatically imported to and exported from the
.Sy csh
variables
.Sy user ,
.Sy term ,
and
.Sy path .
Use
.Sy setenv
if you need to change these variables.
In addition, the shell sets the
.Ev PWD
environment variable from the
.Sy csh
variable
.Sy cwd
whenever the latter changes.
.Pp
The environment variables
.Ev LC_CTYPE ,
.Ev LC_MESSAGES ,
.Ev LC_TIME ,
.Ev LC_COLLATE ,
.Ev LC_NUMERIC ,
and
.Ev LC_MONETARY
take immediate effect when changed within the C shell.
See
.Xr environ 5
for descriptions of these environment variables.
.Pp
.Sy unsetenv
removes
.Ar variable
from the environment.
As with
.Sy unset ,
pattern matching is not performed.
.Sh EXAMPLES
.Bl -tag -width 6
.It Sy Example 1 No Setting the PATH variable to search for files in the
.Pa /bin ,
.Pa /usr/bin
and
.Pa /usr/ucb/bin
directories, in that order:
.Ss csh
.Bd -literal
        % setenv PATH "/bin:/usr/bin:/usr/ucb/bin"
.Ed
.Ss ksh93
.Bd -literal
	$ export PATH="/bin:/usr/bin:/usr/ucb/bin"
.Ed
.El
.Sh SEE ALSO
.Xr csh 1 ,
.Xr ksh93 1 ,
.Xr read 1 ,
.Xr typeset 1 ,
.Xr attributes 5 ,
.Xr environ 5
