citrus-it/illumos-omnios/usr/src/man/man5/policy.conf.5
.\" The contents of this file are subject to the terms of the Common
.\" Development and Distribution License (the "License").  You may not use
.\" this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or
.\" http://www.opensolaris.org/os/licensing.  See the License for the
.\" specific language governing permissions and limitations under the
.\" License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each file
.\" and include the License file at usr/src/OPENSOLARIS.LICENSE.  If
.\" applicable, add the following below this CDDL HEADER, with the fields
.\" enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 2022 OmniOS Community Edition (OmniOSce) Association.
.\"
.Dd March 7, 2022
.Dt POLICY.CONF 5
.Os
.Sh NAME
.Nm policy.conf
.Nd configuration file for security policy
.Sh SYNOPSIS
.Nm /etc/security/policy.conf
.Sh DESCRIPTION
The
.Nm policy.conf
file provides the security policy configuration for user-level attributes.
Each entry consists of a key/value pair in the form:
.Pp
.Sm off
.D1 Ar key = value
.Sm on
.Pp
The following keys are defined:
.Bl -tag -width Ds
.It Sy AUTHS_GRANTED
Specify the default set of authorizations granted to all users.
This entry is interpreted by
.Xr chkauthattr 3SECDB .
The value is zero or more comma-separated authorizations defined in
.Xr auth_attr 5 .
.It Sy PROFS_GRANTED
Specify the default set of profiles granted to all users.
This entry is interpreted by
.Xr chkauthattr 3SECDB
and
.Xr getexecuser 3SECDB .
The value is zero or more comma-separated profiles defined in
.Xr prof_attr 5 .
.It Sy AUTHPROFS_GRANTED
Specify the default set of authenticated profiles granted to all users.
This entry is interpreted by
.Xr chkauthattr 3SECDB
and
.Xr getexecuser 3SECDB .
The value is zero or more comma-separated profiles defined in
.Xr prof_attr 5 .
.It Sy CONSOLE_USER
Specify an additional default set of profiles granted to the owner of
.Pa /dev/console .
This entry is interpreted by
.Xr chkauthattr 3SECDB
and
.Xr getexecuser 3SECDB .
The value is zero or more comma-separated profiles defined in
.Xr prof_attr 5 .
.It Sy PRIV_DEFAULT and Sy PRIV_LIMIT
Settings for these keys determine the default privileges that users have.
.Po
See
.Xr privileges 7
.Pc .
If these keys are not set, the default privileges are taken from the inherited
set.
.Sy PRIV_DEFAULT
determines the default set on login.
.Sy PRIV_LIMIT
defines the limit set on login.
Users can have privileges assigned or taken away through use of
.Xr user_attr 5 .
Privileges can also be assigned to profiles, in which case users who have those
profiles can exercise the assigned privileges through
.Xr pfexec 1 .
.Pp
For maximum future compatibility, the privilege specifications should always
include
.Sy basic
or
.Sy all .
Privileges should then be removed using negation.
See
.Sx EXAMPLES .
By assigning privileges in this way, you avoid a situation where, following an
addition of a currently unprivileged operation to the basic privilege set, a
user unexpectedly does not have the privileges he needs to perform that
now-privileged operation.
.Pp
Note that removing privileges from the limit set requires
.Em extreme
care, as any set-uid root program might suddenly fail because it lacks certain
privilege(s).
Note also that dropping
.Sy basic
privileges from the default privilege set can cause unexpected failure modes in
applications.
.It Sy LOCK_AFTER_RETRIES=YES|NO
Specifies whether a local account is locked after the count of failed logins
for a user equals or exceeds the allowed number of retries as defined by
.Sy RETRIES
in
.Pa /etc/default/login .
The default value for users is
.Sy NO .
Individual account overrides are provided by
.Xr user_attr 5 .
.It Sy CRYPT_ALGORITHMS_ALLOW
Specify the algorithms that are allowed for new passwords and is enforced only
in
.Xr crypt_gensalt 3C .
.It Sy CRYPT_ALGORITHMS_DEPRECATE
Specify the algorithm for new passwords that is to be deprecated.
For example, to deprecate use of the traditional UNIX algorithm, specify
CRYPT_ALGORITHMS_DEPRECATE=__unix__ and change CRYPT_DEFAULT= to another
algorithm, such as CRYPT_DEFAULT=1 for BSD and Linux MD5.
.It Sy CRYPT_DEFAULT
Specify the default algorithm for new passwords.
The Solaris default was once the traditional UNIX algorithm.
This is not listed in
.Xr crypt.conf 5
since it is internal to libc.
The reserved name
.Sq __unix__
is used to refer to it.
.El
.Pp
The key/value pair must appear on a single line, and the key must start the
line.
Lines starting with # are taken as comments and ignored.
Option name comparisons are case-insensitive.
.Pp
Only one
.Sy CRYPT_ALGORITHMS_ALLOW
or
.Sy CRYPT_ALGORITHMS_DEPRECATE
value can be specified.
Whichever is listed first in the file takes precedence.
The algorithm specified for
.Sy CRYPT_DEFAULT
must either be specified for
.Sy CRYPT_ALGORITHMS_ALLOW
or not be specified for
.Sy CRYPT_ALGORITHMS_DEPRECATE .
If
.Sy CRYPT_DEFAULT
is not specified, the default is
.Sq __unix__ .
.Sh FILES
.Bl -tag -width /etc/security/policy.conf
.It Pa /etc/user_attr
Defines extended user attributes.
.It Pa /etc/security/auth_attr
Defines authorizations.
.It Pa /etc/security/prof_attr
Defines profiles.
.It Pa /etc/security/policy.conf
Defines policy for the system.
.El
.Sh EXAMPLES
.Sy Example 1 No Defining a Key/Value Pair
.Bd -literal -offset 4n
AUTHS_GRANTED=solaris.date
.Ed
.Pp
.Sy Example 2 No Specifying Privileges
.Pp
As noted above, you should specify privileges through negation, specifying
.Sy all
for
.Sy PRIV_LIMIT
and
.Sy basic
for
.Sy PRIV_DEFAULT ,
then subtracting privileges, as shown below.
.Bd -literal -offset 4n
PRIV_LIMIT=all,!sys_linkdir
PRIV_DEFAULT=basic,!file_link_any
.Ed
.Pp
The first line, above, takes away only the
.Sy sys_linkdir
privilege.
The second line takes away only the
.Sy file_link
privilege.
These privilege specifications are unaffected by any future addition of
privileges that might occur.
.Sh INTERFACE STABILITY
.Sy Committed .
.Sh SEE ALSO
.Xr login 1 ,
.Xr pfexec 1 ,
.Xr chkauthattr 3SECDB ,
.Xr getexecuser 3SECDB ,
.Xr auth_attr 5 ,
.Xr crypt.conf 5 ,
.Xr prof_attr 5 ,
.Xr user_attr 5 ,
.Xr attributes 7 ,
.Xr privileges 7
