citrus-it/illumos-omnios/usr/src/man/man5/user_attr.5
.\" The contents of this file are subject to the terms of the Common
.\" Development and Distribution License (the "License").  You may not use
.\" this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or
.\" http://www.opensolaris.org/os/licensing.  See the License for the
.\" specific language governing permissions and limitations under the
.\" License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each file
.\" and include the License file at usr/src/OPENSOLARIS.LICENSE.  If
.\" applicable, add the following below this CDDL HEADER, with the fields
.\" enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" Copyright (C) 2008 Sun Microsystems, Inc. All Rights Reserved
.\" Copyright 2020 OmniOS Community Edition (OmniOSce) Association.
.\"
.Dd March 7, 2022
.Dt USER_ATTR 5
.Os
.Sh NAME
.Nm user_attr
.Nd extended user attributes database
.Sh SYNOPSIS
.Nm /etc/user_attr
.Sh DESCRIPTION
.Nm
is a local source of extended attributes associated with users and roles.
.Nm
can be used with other user attribute sources, including the LDAP people
container and the
.Nm
.Sy NIS
map.
Programs use the
.Xr getuserattr 3SECDB
routines to gain access to this information.
.Pp
The search order for multiple
.Nm
sources is specified via
.Xr nsswitch.conf 5 .
The search order follows that for
.Xr passwd 5 .
.Pp
Each entry in the
.Nm
database consists of a single line with five fields separated by colons
.Pq \&: .
Line continuations using the backslash
.Pq \e
character are permitted.
Any leading whitespace is stripped from a continuation line.
Each entry has the form:
.Pp
.Sm off
.D1 Ar user : qualifier : res1 : res2 : attr
.Sm on
.Bl -tag -width qualifier
.It Ar user
The name of the user as specified in the
.Xr passwd 5
database.
.It Ar qualifier
Reserved for future use.
.It Ar res1
Reserved for future use.
.It Ar res2
Reserved for future use.
.It Ar attr
An optional list of semicolon-separated
.Pq \&;
key-value pairs that describe the security attributes to apply to the object
upon execution.
Zero or more keys may be specified.
The following keys are currently interpreted by the system:
.Bl -tag -width Ds
.It Sy auths
Specifies a comma-separated list of authorization names chosen from those names
defined in the
.Xr auth_attr 5
database.
Authorization names may be specified using the asterisk
.Pq \&*
character as a wildcard.
For example,
.Sq solaris.printer.*
means all printer authorizations.
.It Sy profiles
Contains an ordered, comma-separated list of profile names chosen from
.Xr prof_attr 5 .
Any exec attributes applied by one of these profiles is automatically applied
via
.Xr exec 2
if the
.Dv PRIV_PFEXEC
process flag is set.
See
.Xr pfexec 1 .
The profile shells such as
.Xr pfksh 1
and
.Xr pfcsh 1
have this flag set by default.
A default profile is assigned in
.Xr policy.conf 5 .
If no profiles are assigned, the profile shells do not allow the user to
execute any commands.
.It Sy auth_profiles
Contains an ordered, comma-separated list of profile names chosen from
.Xr prof_attr 5 .
The user must authenticate prior to using the rights afforded by these
profiles.
This attribute takes precedence over profiles assigned using the profiles
keyword
.Pp
A list of auth_profiles can also be defined in the
.Xr policy.conf 5
file.
Profiles assigned here will be granted to all users.
.It Sy roleauth
Specifies whether a user assuming a role is required to use the role password
or their own password.
If the
.Sy roleauth
key value is not specified, the role password is required for users assuming
the role.
.It Sy roles
Can be assigned a comma-separated list of role names from the set of user
accounts in this database whose
.Sy type
field indicates the account is a role.
If the
.Sy roles
key value is not specified, the user is not permitted to assume any role.
.It Sy type
Can be assigned one of these strings:
.Sy normal ,
indicating that this account is for a normal user, one who logs in; or
.Sy role ,
indicating that this account is for a role.
Roles can only be assumed by a normal user after the user has logged in.
.It Sy project
Can be assigned a name of one project from the
.Xr project 5
database to be used as a default project to place the user in at login time.
For more information, see
.Xr getdefaultproj 3PROJECT .
.It Sy defaultpriv
The default set of privileges assigned to a user's inheritable set upon login.
See
.Sx Privileges Keywords ,
below.
.It Sy limitpriv
The maximum set of privileges a user or any process started by the user,
whether through
.Xr su 8
or any other means, can obtain.
The system administrator must take extreme care when removing privileges from
the limit set.
Removing any basic privilege has the ability of crippling all applications;
removing any other privilege can cause many or all applications requiring
privileges to malfunction.
See
.Sx Privileges Keywords ,
below.
.It Sy lock_after_retries
Specifies whether an account is locked after the count of failed logins for a
user equals or exceeds the allowed number of retries as defined by
.Sy RETRIES
in
.Pa /etc/default/login .
Possible values are
.Sy yes
or
.Sy no .
The default is
.Sy no .
Account locking is applicable only to local accounts.
.El
.Pp
The following keys are available only if the system is configured with the
Trusted Extensions feature:
.Bl -tag -width Ds
.It Sy clearance
Contains the maximum label at which the user can operate.
If unspecified, in the Defense Intelligence Agency
.Pq Sy DIA
encodings scheme, the default is specified in
.Xr label_encodings 5
.Po
see
.Xr label_encodings 5
and
.Xr labels 7
in the
.%T Solaris Trusted Extensions Reference Manual
.Pc .
.It Sy min_label
Contains the minimum label at which the user can log in.
If unspecified, in the
.Sy DIA
encodings scheme, the default is specified in
.Xr label_encodings 5
.Po
see
.Xr label_encodings 5
and
.Xr labels 7
in the
.%T Solaris Trusted Extensions Reference Manual
.Pc .
.El
.El
.Pp
Except for the
.Sy type
key, the
.Ar key Ns = Ns Ar value
fields in
.Pa /etc/user_attr
can be added using
.Xr roleadd 8
and
.Xr useradd 8 .
You can use
.Xr rolemod 8
and
.Xr usermod 8
to modify
.Ar key Ns = Ns Ar value
fields in
.Pa /etc/user_attr .
Modification of the
.Sy type
key is restricted as described in
.Sy rolemod
and
.Sy usermod .
.Ss Privileges Keywords
The
.Sy defaultpriv
and
.Sy limitpriv
are the privileges-related keywords and are described above.
.Pp
See
.Xr privileges 7
for a description of privileges.
The command
.Sy ppriv Fl l
.Po
see
.Xr ppriv 1
.Pc
produces a list of all supported privileges.
Note that you specify privileges as they are displayed by
.Sy ppriv .
In
.Xr privileges 7 ,
privileges are listed in the form
.Sy PRIV Ns Ar _<privilege_name> .
For example, the privilege
.Sy file_chown ,
as you would specify it in
.Nm ,
is listed in
.Xr privileges 7
as
.Sy PRIV_FILE_CHOWN .
.Pp
See
.Xr usermod 8
for examples of commands that modify privileges and their subsequent effect on
.Nm .
.Sh FILES
.Bl -tag -width Ds
.It Pa /etc/nsswitch.conf
See
.Xr nsswitch.conf 5 .
.It Pa /etc/user_attr
Described here.
.El
.Sh EXAMPLES
.Sy Example 1 No Assigning a Profile to Root
.Pp
The following example entry assigns to root the
.Sy All
profile, which allows root to use all commands in the system, and also assigns
two authorizations:
.Bd -literal -offset 4n
root::::auths=solaris.*,solaris.grant;profiles=All;type=normal
.Ed
.Pp
The solaris.* wildcard authorization shown above gives root all the
.Sy solaris
authorizations; and the solaris.grant authorization gives root the right to
grant to others any
.Sy solaris
authorizations that root has.
The combination of authorizations enables root to grant to others all the
.Sy solaris
authorizations.
See
.Xr auth_attr 5
for more about authorizations.
.Sh INTERFACE STABILITY
The interfaces of the command line utilities are
.Sy Committed .
The output of those utilities are
.Sy Not-An-Interface
and may change at any time.
.Sh SEE ALSO
.Xr auths 1 ,
.Xr pfcsh 1 ,
.Xr pfksh 1 ,
.Xr pfsh 1 ,
.Xr ppriv 1 ,
.Xr profiles 1 ,
.Xr roles 1 ,
.Xr getdefaultproj 3PROJECT ,
.Xr getuserattr 3SECDB ,
.Xr auth_attr 5 ,
.Xr exec_attr 5 ,
.Xr nsswitch.conf 5 ,
.Xr passwd 5 ,
.Xr policy.conf 5 ,
.Xr prof_attr 5 ,
.Xr project 5 ,
.Xr attributes 7 ,
.Xr privileges 7 ,
.Xr roleadd 8 ,
.Xr rolemod 8 ,
.Xr useradd 8 ,
.Xr usermod 8
.Rs
.%B System Administration Guide: Security Services
.Re
.Sh NOTES
The root user is usually defined in local databases for a number of reasons,
including the fact that root needs to be able to log in and do system
maintenance in single-user mode, before the network name service databases are
available.
For this reason, an entry should exist for root in the local
.Nm
file, and the precedence shown in the example
.Xr nsswitch.conf 5
file entry under
.Sx EXAMPLES
is highly recommended.
.Pp
Because the list of legal keys is likely to expand, any code that parses this
database must be written to ignore unknown key-value pairs without error.
When any new keywords are created, the names should be prefixed with a unique
string, such as the company's stock symbol, to avoid potential naming
conflicts.
.Pp
In the
.Sy attr
field, escape the following symbols with a backslash
.Pq \e
if you use them in any value: colon
.Pq \&: ,
semicolon
.Pq \&; ,
carriage return
.Pq \en ,
equals
.Pq \&= ,
or backslash
.Pq \e .
