citrus-it/illumos-omnios/usr/src/man/man8/useradd.8
.\" The contents of this file are subject to the terms of the Common
.\" Development and Distribution License (the "License").  You may not use
.\" this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or
.\" http://www.opensolaris.org/os/licensing.  See the License for the
.\" specific language governing permissions and limitations under the
.\" License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each file
.\" and include the License file at usr/src/OPENSOLARIS.LICENSE.  If
.\" applicable, add the following below this CDDL HEADER, with the fields
.\" enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" Copyright 1989 AT&T
.\" Copyright (c) 2008 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2013 Gary Mills
.\" Copyright (c) 2018 Peter Tribble.
.\" Copyright 2022 OmniOS Community Edition (OmniOSce) Association.
.\"
.Dd March 7, 2022
.Dt USERADD 8
.Os
.Sh NAME
.Nm useradd
.Nd administer a new user login on the system
.Sh SYNOPSIS
.Nm
.Op Fl A Ar authorization Ns Oo \&, Ns Ar authorization Ns Oc Ns \&...
.Op Fl b Ar base_dir
.Op Fl C Ar comment
.Op Fl d Ar dir
.Op Fl e Ar expire
.Op Fl f Ar inactive
.Op Fl g Ar group
.Op Fl G Ar group Ns Oo \&, Ns Ar group Oc Ns \&...
.Op Fl K Ar key Ns \&= Ns Ar value
.Op Fl m Op Fl z | Z
.Op Fl k Ar skel_dir
.Op Fl p Ar projname
.Op Fl P Ar profile Ns Oo \&, Ns Ar profile Oc Ns \&...
.Op Fl R Ar role Ns Oo \&, Ns Ar role Oc Ns \&...
.Op Fl s Ar shell
.Op Fl u Ar uid Op Fl o
.Op Fl X Ar profile Ns Oo \&, Ns Ar profile Oc Ns \&...
.Ar login
.Pp
.Nm
.Fl D
.Op Fl A Ar authorization Ns Oo \&, Ns Ar authorization Ns Oc Ns \&...
.Op Fl b Ar base_dir
.Op Fl e Ar expire
.Op Fl f Ar inactive
.Op Fl g Ar group
.Op Fl K Ar key Ns \&= Ns Ar value
.Op Fl p Ar projname
.Op Fl P Ar profile Ns Oo \&, Ns Ar profile Oc Ns \&...
.Op Fl R Ar role Ns Oo \&, Ns Ar role Oc Ns \&...
.Op Fl s Ar shell
.Op Fl X Ar profile Ns Oo \&, Ns Ar profile Oc Ns \&...
.Sh DESCRIPTION
.Nm
adds a new user to the
.Xr passwd 5
and
.Xr shadow 5
and
.Xr user_attr 5
files.
The
.Fl A ,
.Fl P
and
.Fl X
options respectively assign authorizations, profiles and authenticated profiles
to the user.
The
.Fl R
option assigns roles to the user.
The
.Fl p
option associates a project with the user.
The
.Fl K
option adds a key=value pair to
.Xr user_attr 5
for the user.
Multiple key=value pairs may be added with multiple
.Fl K
options.
.Pp
.Nm
also creates supplementary group memberships for the user
.Po
.Fl G
option
.Pc
and creates the home directory
.Po
.Fl m
option
.Pc
for the user if requested.
The new login remains locked until the
.Xr passwd 1
command is executed.
.Pp
Specifying
.Nm
.Fl D
with the
.Fl A ,
.Fl b ,
.Fl e ,
.Fl f ,
.Fl g ,
.Fl k ,
.Fl K ,
.Fl p ,
.Fl P ,
.Fl R ,
.Fl s
or
.Fl X
option
.Pq or any combination of these options
sets the default values for the respective fields.
See the
.Fl D
option, below.
Subsequent
.Nm
commands without the
.Fl D
option use these arguments.
.Pp
The system file entries created with this command have a limit of 2048
characters per line.
Specifying long arguments to several options can exceed this limit.
.Pp
.Nm
requires that usernames be in the format described in
.Xr passwd 5 .
A warning message is displayed if these restrictions are not met.
See
.Xr passwd 5
for the requirements for usernames.
To change the action of
.Nm
when the traditional login name length limit of eight characters is exceeded,
edit the file
.Pa /etc/default/useradd
by removing the comment
.Pq \&#
before the appropriate
.Dv EXCEED_TRAD Ns =
entry, and adding it before the others.
.Sh OPTIONS
The following options are supported:
.Bl -tag -width Ds
.It Fl A Ar authorization
One or more comma separated authorizations defined in
.Xr auth_attr 5 .
Only a user or role who has
.Sy grant
rights to the authorization can assign it to an account.
.It Fl b Ar base_dir
The base directory for new login home directories
.Po
see the
.Fl d
option below
.Pc .
The directory named by
.Ar base_dir
must already exist and be an absolute path.
.It Fl c Ar comment
A text string.
It is generally a short description of the login, and is currently used as the
field for the user's full name.
This information is stored in the user's
.Xr passwd 5
entry.
.It Fl d Ar dir
The home directory of the new user.
If not supplied, it defaults to
.Ar base_dir Ns / Ns Ar account_name ,
where
.Ar base_dir
is the base directory for new login home directories and
.Ar account_name
is the new login name.
.It Fl D
Display the default values for
.Sy group ,
.Sy base_dir ,
.Sy skel_dir ,
.Sy shell ,
.Sy inactive ,
.Sy expire ,
.Sy proj ,
.Sy projname
and key=value pairs.
When used with the
.Fl A ,
.Fl b ,
.Fl e ,
.Fl f ,
.Fl g ,
.Fl P ,
.Fl p ,
.Fl R ,
.Fl K
or
.Fl X
options, the
.Fl D
option sets the default values for the specified fields.
The default values are:
.Bl -tag -width 16n
.It Sy group
.Sy other
.Po
.Sy GID
of 1
.Pc
.It Sy base_dir
.Pa /home
.It Sy skel_dir
.Pa /etc/skel
.It Sy shell
.Pa /bin/sh
.It Sy inactive
.Sy 0
.It Sy expire
null
.It Sy auths
null
.It Sy profiles
null
.It Sy auth_profiles
null
.It Sy proj
.Sy 3
.It Sy projname
.Sy default
.It key=value Pq pairs defined in Xr user_attr 5
not present
.It Sy roles
null
.El
.It Fl e Ar expire
Specify the expiration date for a login.
After this date, no user will be able to access this login.
The expire option argument is a date entered using one of the date formats
included in the template file
.Pa /etc/datemsk .
See
.Xr getdate 3C .
.Pp
If the date format that you choose includes spaces, it must be quoted.
For example, you can enter
.Sy 10/6/90
or October 6, 1990.
A null value
.Pq Dq \&
defeats the status of the expired date.
This option is useful for creating temporary logins.
.It Fl f Ar inactive
The maximum number of days allowed between uses of a login ID before that
.Sy ID
is declared invalid.
Normal values are positive integers.
A value of
.Sy 0
defeats the status.
.It Fl g Ar group
An existing group's integer
.Sy ID
or character-string name.
Without the
.Fl D
option, it defines the new user's primary group membership and defaults to the
default group.
You can reset this default value by invoking
.Nm
.Fl D
.Fl g
.Ar group .
GIDs 0-99 are reserved for allocation by the Operating System.
.It Fl G Ar group
One or more comma-separated existing groups, specified by integer
.Sy ID
or character-string name.
It defines the new user's supplementary group membership.
Any duplicate groups between the
.Fl g
and
.Fl G
options are ignored.
No more than
.Dv NGROUPS_MAX
groups can be specified.
GIDs 0-99 are reserved for allocation by the Operating System.
.It Fl k Ar skel_dir
A directory that contains skeleton information
.Po
such as
.Pa .profile
.Pc
that can be copied into a new user's home directory.
This directory must already exist.
The system provides the
.Pa /etc/skel
directory that can be used for this purpose.
.It Fl K Ar key Ns \&= Ns Ar value
A key=value pair to add to the user's attributes.
Multiple
.Fl K
options may be used to add multiple key=value pairs.
The generic
.Fl K
option with the appropriate key may be used instead of the specific implied key
options
.Po
.Fl A ,
.Fl p ,
.Fl P ,
.Fl R ,
.Fl X
.Pc .
See
.Xr user_attr 5
for a list of valid key=value pairs.
The
.Sq type
key is not a valid key for this option.
Keys cannot be repeated.
.It Fl m Op Fl z | Z
Create the new user's home directory if it does not already exist.
If the directory already exists, it must have read, write, and execute
permissions by
.Ar group ,
where
.Ar group
is the user's primary group.
.Pp
If the parent directory of the user's home directory is located on a separate
.Xr zfs 8
file system and the
.Pa /etc/default/useradd
file contains the parameter
.Dv MANAGE_ZFS
set to the value
.Sy YES ,
a new
.Sy ZFS
file system will be created for the user.
.Pp
If the
.Fl z
option is specified,
.Nm
will always try to create a new file system for the home directory.
.Pp
If the
.Fl Z
option is specified, a new file system will never be created.
.It Fl o
This option allows a
.Sy UID
to be duplicated
.Pq non-unique .
.It Fl p Ar projname
Name of the project with which the added user is associated.
See the
.Ar projname
field as defined in
.Xr project 5 .
.It Fl P Ar profile
One or more comma-separated execution profiles defined in
.Xr prof_attr 5 .
These profiles are assigned to the user's unauthenticated profile list.
See also
.Fl X .
.It Fl R Ar role
One or more comma-separated roles defined in
.Xr user_attr 5 .
Roles cannot be assigned to other roles.
.It Fl s Ar shell
Full pathname of the program used as the user's shell on login.
It defaults to an empty field causing the system to use
.Pa /bin/sh
as the default.
The value of
.Ar shell
must be a valid executable file.
.It Fl u Ar uid
The
.Sy UID
of the new user.
This
.Sy UID
must be a non-negative decimal integer below
.Dv MAXUID
as defined in
.In sys/param.h
The
.Sy UID
defaults to the next available
.Pq unique
number above the highest number currently assigned.
For example, if
.Sy UID Ns No s
100, 105, and 200 are assigned, the next default
.Sy UID
number will be 201.
.Sy UID Ns No s
.Sy 0 - Sy 99
are reserved for allocation by the Operating System.
.It Fl X Ar profile
One or more comma-separated execution profiles defined in
.Xr prof_attr 5 .
These profiles are assigned to the user's authenticated profile list.
See also
.Fl P .
.El
.Sh FILES
.Bl -item
.It
.Pa /etc/default/useradd
.It
.Pa /etc/datemsk
.It
.Pa /etc/passwd
.It
.Pa /etc/shadow
.It
.Pa /etc/group
.It
.Pa /etc/skel
.It
.Pa /usr/include/limits.h
.It
.Pa /etc/user_attr
.El
.Sh DIAGNOSTICS
In case of an error,
.Nm
prints an error message and exits with a non-zero status.
.Pp
The following indicates that
.Ar login
specified is already in use:
.Bd -literal -offset 4n
UX: useradd: ERROR: login is already in use. Choose another.
.Ed
.Pp
The following indicates that the
.Ar uid
specified with the
.Fl u
option is not unique:
.Bd -literal -offset 4n
UX: useradd: ERROR: uid <uid> is already in use. Choose another.
.Ed
.Pp
The following indicates that the
.Ar group
specified with the
.Fl g
option does not exist:
.Bd -literal -offset 4n
UX: useradd: ERROR: group <group> does not exist. Choose another.
.Ed
.Pp
The following indicates that the
.Ar uid
specified with the
.Fl u
option is in the range of reserved
.Sy UID Ns No s
.Po
from
.Sy 0
-
.Sy 99
.Pc :
.Bd -literal -offset 4n
UX: useradd: WARNING: uid <uid> is reserved.
.Ed
.Pp
The following indicates that the
.Ar uid
specified with the
.Fl u
option exceeds
.Dv MAXUID
as defined in
.In sys/param.h :
.Bd -literal -offset 4n
UX: useradd: ERROR: uid <uid> is too big. Choose another.
.Ed
.Pp
The following indicates that the
.Pa /etc/passwd
or
.Pa /etc/shadow
files do not exist:
.Bd -literal -offset 4n
UX: useradd: ERROR: Cannot update system files \e
    - login cannot be created.
.Ed
.Sh INTERFACE STABILITY
The command line interface of
.Nm
is
.Sy Committed .
The output of
.Nm
is
.Sy Not-An-Interface
and may change at any time.
.Sh SEE ALSO
.Xr passwd 1 ,
.Xr profiles 1 ,
.Xr roles 1 ,
.Xr getdate 3C ,
.Xr auth_attr 5 ,
.Xr passwd 5 ,
.Xr prof_attr 5 ,
.Xr project 5 ,
.Xr user_attr 5 ,
.Xr attributes 7 ,
.Xr groupadd 8 ,
.Xr groupdel 8 ,
.Xr groupmod 8 ,
.Xr grpck 8 ,
.Xr logins 8 ,
.Xr pwck 8 ,
.Xr userdel 8 ,
.Xr usermod 8 ,
.Xr zfs 8
.Sh NOTES
The
.Nm
utility adds definitions to only the local
.Pa /etc/group ,
.Pa /etc/passwd ,
.Pa /etc/shadow ,
.Pa /etc/project ,
and
.Pa /etc/user_attr
files.
If a network name service is being used to supplement the local
.Pa /etc/passwd
file with additional entries,
.Nm
cannot change information supplied by the network name service.
However
.Nm
will verify the uniqueness of the user name
.Pq or role
and user id and the existence of any group names specified against the external
name service.
