citrus-it/illumos-omnios/usr/src/man/man8/usermod.8
.\" All Rights Reserved
.\"
.\" The contents of this file are subject to the terms of the Common
.\" Development and Distribution License (the "License").  You may not use
.\" this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or
.\" http://www.opensolaris.org/os/licensing.  See the License for the
.\" specific language governing permissions and limitations under the
.\" License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each file
.\" and include the License file at usr/src/OPENSOLARIS.LICENSE.  If
.\" applicable, add the following below this CDDL HEADER, with the fields
.\" enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" Copyright 1989 AT&T Copyright (c) 2004, 2009, Sun Microsystems, Inc.
.\" Copyright (c) 2018 Peter Tribble.
.\" Copyright 2022 OmniOS Community Edition (OmniOSce) Association.
.\"
.Dd March 7, 2022
.Dt USERMOD 8
.Os
.Sh NAME
.Nm usermod
.Nd modify a user's login information on the system
.Sh SYNOPSIS
.Nm
.Op Fl u Ar uid Op Fl o
.Op Fl g Ar group
.Op Fl G Ar group Ns Oo \&, Ns Ar group Oc Ns \&...
.Op Fl d Ar dir Op Fl m Op Fl z | Z
.Op Fl s Ar shell
.Op Fl c Ar comment
.Op Fl l Ar new_name
.Op Fl f Ar inactive
.Op Fl e Ar expire
.Op Fl A Ar authorization Ns Oo \&, Ns Ar authorization Ns Oc Ns \&...
.Op Fl P Ar profile Ns Oo \&, Ns Ar profile Oc Ns \&...
.Op Fl R Ar role Ns Oo \&, Ns Ar role Oc Ns \&...
.Op Fl X Ar profile Ns Oo \&, Ns Ar profile Oc Ns \&...
.Op Fl K Ar key Ns \&= Ns Ar value
.Ar login
.Sh DESCRIPTION
The
.Nm
utility modifies a user's login definition on the system.
It changes the definition of the specified login and makes the appropriate
login-related system file and file system changes.
.Pp
The system file entries created with this command have a limit of 512
characters per line.
Specifying long arguments to several options can exceed this limit.
.Sh OPTIONS
The following options are supported:
.Bl -tag -width Ds
.It Fl A Ar authorization
One or more comma separated authorizations as defined in
.Xr auth_attr 5 .
Only a user or role who has
.Sy grant
rights to the
.Sy authorization
can assign it to an account.
This replaces any existing authorization setting.
If an empty authorization list is specified, the existing setting is removed.
.It Fl c Ar comment
Specify a comment string.
.Ar comment
can be any text string.
It is generally a short description of the login, and is currently used as the
field for the user's full name.
This information is stored in the user's
.Pa /etc/passwd
entry.
.It Fl d Ar dir
Specify the new home directory of the user.
It defaults to
.Ar base_dir Ns / Ns Ar login ,
where
.Ar base_dir
is the base directory for new login home directories, and
.Sy login
is the new login.
.It Fl e Ar expire
Specify the expiration date for a login.
After this date, no user will be able to access this login.
The expire option argument is a date entered using one of the date formats
included in the template file
.Pa /etc/datemsk .
See
.Xr getdate 3C .
.Pp
For example, you may enter
.Sy 10/6/90
or October 6, 1990.
A null value
.Pq Dq \&
defeats the status of the expired date.
.It Fl f Ar inactive
Specify the maximum number of days allowed between uses of a login
.Sy ID
before that login
.Sy ID
is declared invalid.
Normal values are positive integers.
A value of
.Sy 0
defeats the status.
.It Fl g Ar group
Specify an existing group's integer
.Sy ID
or character-string name.
It redefines the user's primary group membership.
.It Fl G Ar group
One or more comma-separated existing groups, specified by integer
.Sy ID
or character-string name.
It redefines the user's supplementary group membership.
Any duplicate groups between the
.Fl g
and
.Fl G
options are ignored.
No more than
.Dv NGROUPS_UMAX
groups may be specified as defined in
.In sys/param.h
.It Fl K Ar key Ns \&= Ns Ar value
Replace existing or add to a user's key=value pair attributes.
Multiple
.Fl K
options can be used to replace or add multiple key=value pairs.
However, keys must not be repeated.
The generic
.Fl K
option with the appropriate key can be used instead of the specific implied key
options
.Po
.Fl A ,
.Fl P ,
.Fl R ,
.Fl X ,
.Fl p
.Pc .
See
.Xr user_attr 5
for a list of valid
.Ar key Ns No s .
Values for these keys are usually found in man pages or other sources related
to those keys.
For example, see
.Xr project 5
for guidance on values for the
.Sy project
key.
Use the command
.Xr ppriv 1
with the
.Fl v
and
.Fl l
options for a list of values for the keys
.Sy defaultpriv
and
.Sy limitpriv .
.Pp
The keyword
.Cm type
can be specified with the value
.Cm role
or the value
.Cm normal .
When using the value
.Cm role ,
the account changes from a normal user to a role; using the value
.Cm normal
keeps the account a normal user.
.Pp
As a
.Sy role
account, no roles
.Po
.Fl R
or roles=value
.Pc
can be present.
.It Fl l Ar new_logname
Specify the new login name for the user.
See
.Xr passwd 5
for the requirements for usernames.
.It Fl m Op Fl z | Z
Move the user's home directory to the new directory specified with the
.Fl d
option.
If the directory already exists, it must have permissions read/write/execute by
.Ar group ,
where
.Ar group
is the user's primary group.
.Pp
If the user's old home directory was located on a separate
.Xr zfs 8
file system and the
.Pa /etc/default/useradd
file contains the parameter
.Dv MANAGE_ZFS
set to the value
.Sy YES ,
the file system will be destroyed after the home directory is moved.
If the parent directory of the user's new home directory is located on a
separate
.Sy ZFS
filesystem and the
.Pa /etc/default/useradd
file contains the parameter
.Dv MANAGE_ZFS
set to the value
.Sy YES ,
a new
.Sy ZFS
file system will be created.
.Pp
If the
.Fl z
option is specified,
.Nm
will always try to create a new file system for the home directory and destroy
the old one.
.Pp
If the
.Fl Z
option is specified, a new file system will never be created, and the old one
will never be destroyed.
.It Fl o
This option allows the specified
.Sy UID
to be duplicated
.Pq non-unique .
.It Fl P Ar profile
One or more comma-separated execution profiles defined in
.Xr prof_attr 5 .
This replaces any existing profile setting in
.Xr user_attr 5 .
If an empty profile list is specified, the existing setting is removed.
This option applies to the user's unauthenticated profile list; see also
.Fl X .
.It Fl R Ar role
One or more comma-separated roles
.Po
see
.Xr roleadd 8
.Pc .
This replaces any existing role setting.
If an empty role list is specified, the existing setting is removed.
.It Fl s Ar shell
Specify the full pathname of the program that is used as the user's shell on
login.
The value of
.Ar shell
must be a valid executable file.
.It Fl u Ar uid
Specify a new
.Sy UID
for the user.
It must be a non-negative decimal integer less than
.Dv MAXUID
as defined in
.In sys/param.h .
The
.Sy UID
associated with the user's home directory is not modified with this option; a
user will not have access to their home directory until the
.Sy UID
is manually reassigned using
.Xr chown 1 .
.It Fl X Ar profile
One or more comma-separated execution profiles defined in
.Xr prof_attr 5 .
This replaces any existing authenticated profile setting in
.Xr user_attr 5 .
If an empty profile list is specified, the existing setting is removed.
This option applies to the user's authenticated profile list; see also
.Fl P .
.El
.Sh OPERANDS
The following operands are supported:
.Bl -tag -width Ds
.It Ar login
An existing login name to be modified.
.El
.Sh FILES
.Bl -tag -width Ds
.It Pa /etc/default/useradd
configuration file for user and role administrative commands
.It Pa /etc/group
system file containing group definitions
.It Pa /etc/datemsk
system file of date formats
.It Pa /etc/passwd
system password file
.It Pa /etc/shadow
system file containing users' and roles' encrypted passwords and related
information
.It Pa /etc/user_attr
system file containing additional user and role attributes
.El
.Sh EXIT STATUS
In case of an error,
.Nm
prints an error message and exits with one of the following values:
.Bl -tag -width Ds
.It 2
The command syntax was invalid.
A usage message for the
.Nm
command is displayed.
.It 3
An invalid argument was provided to an option.
.It 4
The
.Ar uid
given with the
.Fl u
option is already in use.
.It 5
The password files contain an error.
.Xr pwconv 8
can be used to correct possible errors.
See
.Xr passwd 5 .
.It 6
The login to be modified does not exist, the
.Ar group
does not exist, or the login shell does not exist.
.It 8
The login to be modified is in use.
.It 9
The
.Ar new_logname
is already in use.
.It 10
Cannot update the
.Pa /etc/group
or
.Pa /etc/user_attr
file.
Other update requests will be implemented.
.It 11
Insufficient space to move the home directory
.Po
.Fl m
option
.Pc .
Other update requests will be implemented.
.It  12
Unable to complete the move of the home directory to the new home directory.
.El
.Sh EXAMPLES
.Sy Example 1 No Assigning Privileges to a User
.Pp
The following command adds the privilege that affects high resolution times to
a user's initial, inheritable set of privileges.
.Bd -literal -offset 4n
# usermod -K defaultpriv=basic,proc_clock_highres jdoe
.Ed
.Pp
This command results in the following entry in the
.Xr user_attr 5
database:
.Bd -literal -offset 4n
jdoe::::type=normal;defaultpriv=basic,proc_clock_highres
.Ed
.Pp
.Sy Example 2 No  Removing a Privilege from a User's Limit Set
.Pp
The following command removes the privilege that allows the specified user to
create hard links to directories and to unlink directories.
.Bd -literal -offset 4n
# usermod -K limitpriv=all,!sys_linkdir jdoe
.Ed
.Pp
This command results in the following entry in the
.Xr user_attr 5
database:
.Bd -literal -offset 4n
jdoe::::type=normal;defaultpriv=basic,limitpriv=all,!sys_linkdir
.Ed
.Pp
.Sy Example 3 No Removing a Privilege from a User's Basic Set
.Pp
The following command removes the privilege that allows the specified user to
examine processes outside the user's session.
.Bd -literal -offset 4n
# usermod -K defaultpriv=basic,!proc_session jdoe
.Ed
.Pp
This command results in the following entry in the
.Xr user_attr 5
database:
.Bd -literal -offset 4n
jdoe::::type=normal;defaultpriv=basic,!proc_session;limitpriv=all
.Ed
.Pp
.Sy Example 4 No Assigning a Role to a User
.Pp
The following command assigns a role to a user.
The role must have been created prior to this command, see
.Xr roleadd 8 .
.Bd -literal -offset 4n
# usermod -R mailadm jdoe
.Ed
.Pp
This command results in the following entry in the
.Xr user_attr 5
database:
.Bd -literal -offset 4n
jdoe::::type=normal;roles=mailadm;defaultpriv=basic;limitpriv=all
.Ed
.Pp
.Sy Example 5 No Removing All Profiles from a User
.Pp
The following command removes all profiles that were granted to a user directly.
The user will still have any execution profiles that are granted by means of the
.Dv PROFS_GRANTED
key in
.Xr policy.conf 5 .
.Bd -literal -offset 4n
# usermod -P "" jdoe
.Ed
.Sh INTERFACE STABILITY
The command line interface of
.Nm
is
.Sy Committed .
The output of
.Nm
is
.Sy Not-An-Interface
and may change at any time.
.Sh SEE ALSO
.Xr chown 1 ,
.Xr passwd 1 ,
.Xr getdate 3C ,
.Xr auth_attr 5 ,
.Xr passwd 5 ,
.Xr policy.conf 5 ,
.Xr prof_attr 5 ,
.Xr user_attr 5 ,
.Xr attributes 7 ,
.Xr groupadd 8 ,
.Xr groupdel 8 ,
.Xr groupmod 8 ,
.Xr logins 8 ,
.Xr pwconv 8 ,
.Xr roleadd 8 ,
.Xr roledel 8 ,
.Xr rolemod 8 ,
.Xr useradd 8 ,
.Xr userdel 8 ,
.Xr zfs 8
.Sh NOTES
The
.Nm
utility modifies
.Sy passwd
definitions only in the local
.Pa /etc/passwd
and
.Pa /etc/shadow
files.
If a network nameservice is being used to supplement the local files with
additional entries,
.Nm
cannot change information supplied by the network nameservice.
However
.Nm
will verify the uniqueness of user name and user
.Sy ID
against the external nameservice.
.Pp
The
.Nm
utility uses the
.Pa /etc/datemsk
file for date formatting.
