citrus-it/illumos-omnios/usr/src/man/man4d/uhsmp.4d
.\"
.\" This file and its contents are supplied under the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.illumos.org/license/CDDL.
.\"
.\"
.\" Copyright 2026 Oxide Computer Company
.\"
.Dd June 17, 2026
.Dt UHSMP 4D
.Os
.Sh NAME
.Nm uhsmp
.Nd AMD HSMP user access driver
.Sh SYNOPSIS
.Pa /devices/pseudo/amdzen@0/uhsmp@5:uhsmp.*
.Sh DESCRIPTION
The
.Nm
driver provides the ability to issue commands to the Host System Management
Port
.Pq HSMP
on AMD Family 19h
.Pq Zen 3 and Zen 4 ,
and AMD Family 1ah
.Pq Zen 5
processors.
.Pp
The
.Nm
driver also exports a selection of HSMP telemetry through the
.Xr kstat 8
facility, refreshed periodically.
For each data fabric it publishes a named kstat with module
.Sy uhsmp ,
instance set to the data fabric number, and name
.Sy metrics .
Depending on the processor, the members include the socket power consumption,
the data fabric and memory clock frequencies, the core clock throttle limit,
the average C0 residency, and the current socket frequency and its limiting
source.
The
.Sy last_sample
member records the time of the most recent successful sample, on the same time
base as
.Xr gethrtime 3C ,
and
.Sy sample_errors
counts samples that did not complete.
.Pp
On processors that maintain an SMU metric table, a decoded socket-wide subset of
that table is published as additional
.Sy mt_
prefixed members of the
.Sy metrics
kstat, and the complete table is published as a raw kstat with name
.Sy metric_table .
The layout of the raw table is described by the structures in
.In sys/amdzen/hsmp.h
and the
.Sy metric_table_version
member identifies which layout applies.
.Sh SEE ALSO
.Xr gethrtime 3C ,
.Xr amdzen 4D ,
.Xr zen_udf 4D ,
.Xr kstat 8
